class Test5 {
	public static void main(String[] args) {
		/*
		使用双重循环实现五子棋游戏棋盘的绘制
		  0 1 2 3 4 5 6 7 8 9 a b c d e f
		0 + + + + + + + + + + + + + + + +
		1 + + + + + + + + + + + + + + + +
		2 + + + + + + + + + + + + + + + +
		3 + + + + + + + + + + + + + + + +
		4 + + + + + + + + + + + + + + + +
		5 + + + + + + + + + + + + + + + +
		6 + + + + + + + + + + + + + + + +
		7 + + + + + + + + + + + + + + + +
		8 + + + + + + + + + + + + + + + +
		9 + + + + + + + + + + + + + + + +
		a + + + + + + + + + + + + + + + +
		b + + + + + + + + + + + + + + + +
		c + + + + + + + + + + + + + + + +
		d + + + + + + + + + + + + + + + +
		e + + + + + + + + + + + + + + + +
		f + + + + + + + + + + + + + + + +
		*/
		/*
		思路:
			1. 这个棋盘的第一行与其它行不同,开头是一个空格,后面是0-f的十六进制数,这一行可以单独摘出来绘制
			2. 利用双重循环可以打印出一个都是+的16行x17列的棋盘
					a. 每一行的开头都是行数的十六进制
					b. 既然如此不如将每行的第一列打印放到外循环中,每次外循环开始时先打印第一列,再进入内循环打印其他的列
		*/

		//1. 这个棋盘的第一行与其它行不同,开头是一个空格,后面是0-f的十六进制数,这一行可以单独摘出来绘制
		//打印第一行
		System.out.print("  ");
		for (int r = 0; r < 16; r++) {
			System.out.print(Integer.toHexString(r) + " ");//数字后加个空格,在控制台上的效果比较好看
		}
		System.out.println("");
		
		//打印 16行 x 17列的棋盘
		for (int i = 0; i < 16; i++) {
			//每次外循环开始,先打印这一行的第一列
			System.out.print(Integer.toHexString(i) + " ");
			//打印剩下的十六列
			for (int j = 0; j < 16; j++) {
				System.out.print("+ ");
			}
			//换行,开始下一列
			System.out.println("");
		}
	}
}
