/*
SQLyog Ultimate v13.1.1 (64 bit)
MySQL - 8.0.23 : Database - student_management_system
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`student_management_system` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `student_management_system`;

/*Table structure for table `student` */

DROP TABLE IF EXISTS `student`;

CREATE TABLE `student` (
  `student_id` varchar(32) NOT NULL,
  `number` int NOT NULL,
  `name` varchar(20) NOT NULL,
  `gender` varchar(1) DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `email` varchar(254) DEFAULT NULL,
  `notes` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`student_id`),
  UNIQUE KEY `number` (`number`),
  KEY `index_name` (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

/*Data for the table `student` */

insert  into `student`(`student_id`,`number`,`name`,`gender`,`birthday`,`email`,`notes`) values 
('015923ccf1d04e369a4944d48474504b',20210070,'红叶70号','男','1991-12-12','mercy70@163.com','notes70'),
('080bed3544274d29b7ec681221f40939',20210105,'红叶105号','女','1991-12-12','mercy105@163.com','notes105'),
('081173c6a325401094967d97acb16409',20210090,'红叶90号','男','1991-12-12','mercy90@163.com','notes90'),
('09c8ea58190e4b6e9900df2d4c00a937',20210062,'红叶62号','男','1991-12-12','mercy62@163.com','notes62'),
('0a1f4726aae84e47acd328485b3f4d4b',20210079,'红叶79号','女','1991-12-12','mercy79@163.com','notes79'),
('14bc0513966040dd9a8234ae4770d9c0',20210051,'红叶51号','女','1991-12-12','mercy51@163.com','notes51'),
('1513a625210d41eea7b8fd99e1a43849',20210030,'红叶30号','男','1991-12-12','mercy30@163.com','notes30'),
('1e41f022be6e479493600d7bc1893f8d',20210057,'红叶57号','女','1991-12-12','mercy57@163.com','notes57'),
('2252ea825f124f3cbfaf30b07edfd8c7',20210049,'红叶49号','女','1991-12-12','mercy49@163.com','notes49'),
('25e12617ad214afa8fb4864164ed5cb6',20210050,'红叶50号','男','1991-12-12','mercy50@163.com','notes50'),
('2fb429ca28b5443c8abc80511e458179',20210089,'红叶89号','女','1991-12-12','mercy89@163.com','notes89'),
('32adc35fc1444e7291f40bcb5162b1c5',20210096,'红叶96号','男','1991-12-12','mercy96@163.com','notes96'),
('33edf9b4af9e49ec8870808f920e345a',20210108,'红叶108号','男','1991-12-12','mercy108@163.com','notes108'),
('35fb1139f9f04cba9f62d7918d5f680d',20210081,'红叶81号','女','1991-12-12','mercy81@163.com','notes81'),
('375b53d0085a4275b0d1716ab8e38000',20210012,'红叶12号','男','1991-12-12','mercy12@163.com','notes12'),
('3e4bdc7df72b47958d74e1da7cb4dd2b',20210039,'红叶39号','女','1991-12-12','mercy39@163.com','notes39'),
('3e8f93bf2c774685a4d241a67a98f2b9',20210033,'红叶33号','女','1991-12-12','mercy33@163.com','notes33'),
('4320f0e118644950876e21996da254e1',20210085,'红叶85号','女','1991-12-12','mercy85@163.com','notes85'),
('442e77cb0c7a47059e903333e204c2f4',20210082,'红叶82号','男','1991-12-12','mercy82@163.com','notes82'),
('4708cd9414584b5c932e9f5fa996feea',20210032,'红叶32号','男','1991-12-12','mercy32@163.com','notes32'),
('4aaac96be600483390b4687adf7aef69',20210102,'红叶102号','男','1991-12-12','mercy102@163.com','notes102'),
('4d8849e1062346159c9ba1ce996f6471',20210067,'红叶67号','女','1991-12-12','mercy67@163.com','notes67'),
('52ccd013755b49408a22f891bc07e064',20210029,'红叶29号','女','1991-12-12','mercy29@163.com','notes29'),
('532de7bf2d2f46f0971735f1ab1d6b9f',20210086,'红叶86号','男','1991-12-12','mercy86@163.com','notes86'),
('547a3051cf2d42d0bfac7c702ce38060',20210091,'红叶91号','女','1991-12-12','mercy91@163.com','notes91'),
('54f6d83e473142d0bab5b3262e81c1ec',20210087,'红叶87号','女','1991-12-12','mercy87@163.com','notes87'),
('5908a7b6442c45c8bbf8dfcc857ce20a',20210044,'红叶44号','男','1991-12-12','mercy44@163.com','notes44'),
('5b01b14791174d6d8788cb209e5b0d89',20210055,'红叶55号','女','1991-12-12','mercy55@163.com','notes55'),
('5b8a7f1e0ab14aeda4fcb1f6727ec60b',20210016,'红叶16号','男','1991-12-12','mercy16@163.com','notes16'),
('5d2152c6aa9d436aa5aa9ff528e27ee4',20210068,'红叶68号','男','1991-12-12','mercy68@163.com','notes68'),
('64a8a241ba9344de98022445a1b5c3e1',20210069,'红叶69号','女','1991-12-12','mercy69@163.com','notes69'),
('682178d70daa4f6a8369faf73561a425',20210052,'红叶52号','男','1991-12-12','mercy52@163.com','notes52'),
('68fad5d057624f3698ff8341ccb0fe1b',20210035,'红叶35号','女','1991-12-12','mercy35@163.com','notes35'),
('6b15bfed9467494698300a15a38f51f8',20210059,'红叶59号','女','1991-12-12','mercy59@163.com','notes59'),
('6cd2d7ca9bc1448c9d054f52652cb622',20210077,'红叶77号','女','1991-12-12','mercy77@163.com','notes77'),
('6d5a9f8d4f624ea385da762b131e7556',20210080,'红叶80号','男','1991-12-12','mercy80@163.com','notes80'),
('722fab8c658f4c819ef49a646f54810a',20210073,'红叶73号','女','1991-12-12','mercy73@163.com','notes73'),
('791937426c9740b39552f566c73ff200',20210047,'红叶47号','女','1991-12-12','mercy47@163.com','notes47'),
('80cd06f910ef41a28d760c755dcee044',20210038,'红叶38号','男','1991-12-12','mercy38@163.com','notes38'),
('80dc92ba62634a05bda6f6c3cfcc74ce',20210075,'红叶75号','女','1991-12-12','mercy75@163.com','notes75'),
('863c0bb0721e47179ea06c89c2f6a703',20210083,'红叶83号','女','1991-12-12','mercy83@163.com','notes83'),
('883e7cd66ec44a03a3e6e3c31d3bf94f',20210058,'红叶58号','男','1991-12-12','mercy58@163.com','notes58'),
('89911beac164451fbe83c2ee900a304b',20210053,'红叶53号','女','1991-12-12','mercy53@163.com','notes53'),
('89bc7e1eea72488abbb39bc7e38d119d',20210034,'红叶34号','男','1991-12-12','mercy34@163.com','notes34'),
('8a5b029f973b40058050fda8efbef1fa',20210101,'红叶101号','女','1991-12-12','mercy101@163.com','notes101'),
('8cbcd4f133ee4701956162fc8b78067b',20210045,'红叶45号','女','1991-12-12','mercy45@163.com','notes45'),
('8e4d816dc63245bdbdce99d1b33c999b',20210040,'红叶40号','男','1991-12-12','mercy40@163.com','notes40'),
('903cb920b23044a8905ed211b1daf84d',20210042,'红叶42号','男','1991-12-12','mercy42@163.com','notes42'),
('90b5d2173d3446e087c1f0218025213d',20210066,'红叶66号','男','1991-12-12','mercy66@163.com','notes66'),
('92696625de824f0ebcfc835d1acf3e3d',20210063,'红叶63号','女','1991-12-12','mercy63@163.com','notes63'),
('929b36eff6044b0e85c100c0df243090',20210060,'红叶60号','男','1991-12-12','mercy60@163.com','notes60'),
('93c4bf325a2b407084dda5de2b5922f0',20210095,'红叶95号','女','1991-12-12','mercy95@163.com','notes95'),
('9478ef13a69d4a61b3e0a1cdce6d7f63',20210046,'红叶46号','男','1991-12-12','mercy46@163.com','notes46'),
('9e3f41b30e8c41d6931853d1d7b909cf',20210017,'红叶17号','女','1991-12-12','mercy17@163.com','notes17'),
('9fc926004a954a8c965c72ed3ae2c83d',20210020,'红叶20号','男','1991-12-12','mercy20@163.com','notes20'),
('a0d62b23052249e58f2a537d7a536668',20210100,'红叶100号','男','1991-12-12','mercy100@163.com','notes100'),
('a1cdb1b98c90438ba67d173c16186f3b',20210092,'红叶92号','男','1991-12-12','mercy92@163.com','notes92'),
('a25afdb297894873aab3aa113c4990bd',20210061,'红叶61号','女','1991-12-12','mercy61@163.com','notes61'),
('a4be9934c40746c3ae7bd15d32eb9c58',20210019,'红叶19号','女','1991-12-12','mercy19@163.com','notes19'),
('a601b0068b61401890c4616a608d292b',20210071,'红叶71号','女','1991-12-12','mercy71@163.com','notes71'),
('a69154d0699342e3b6585774075dd70d',20210023,'红叶23号','女','1991-12-12','mercy23@163.com','notes23'),
('a72e07b41ca84a228ce6c8eac4ba001d',20210013,'红叶13号','女','1991-12-12','mercy13@163.com','notes13'),
('aae254e397f047928047fc580f70f8bf',20210011,'红叶11号','女','1991-12-12','mercy11@163.com','notes11'),
('ad328af717f942d9b91443eecf49fb5e',20210024,'红叶24号','男','1991-12-12','mercy24@163.com','notes24'),
('afa4d2727e974f12bb69a958fb706f9c',20210028,'红叶28号','男','1991-12-12','mercy28@163.com','notes28'),
('b017ad850ff5445d925fd15d42194d6f',20210054,'红叶54号','男','1991-12-12','mercy54@163.com','notes54'),
('b08cd925fe6b462d82445758a7ee4567',20210104,'红叶104号','男','1991-12-12','mercy104@163.com','notes104'),
('b2babe55999c440c96ca3c9013b8ec9f',20210010,'红叶10号','男','1991-12-12','mercy10@163.com','notes10'),
('b5a2415926354806ae8da4f674db2724',20210109,'红叶109号','女','1991-12-12','mercy109@163.com','notes109'),
('b752f77895df426b8f7cc8282bf97285',20210037,'红叶37号','女','1991-12-12','mercy37@163.com','notes37'),
('b7ea67c5a2ac448a9611c3506c5b5523',20210043,'红叶43号','女','1991-12-12','mercy43@163.com','notes43'),
('b9210b2d4d294dd9a4f0a072996a3367',20210026,'红叶26号','男','1991-12-12','mercy26@163.com','notes26'),
('c0b6d2dab4394843a0293896efdf2978',20210107,'红叶107号','女','1991-12-12','mercy107@163.com','notes107'),
('c0fb791938de410ba4c8c8c5dab0534e',20210097,'红叶97号','女','1991-12-12','mercy97@163.com','notes97'),
('c3d738ac34ce4d9a884c3bc58a8edbaa',20210099,'红叶99号','女','1991-12-12','mercy99@163.com','notes99'),
('c467d3d73ccc49beb097faeee0882658',20210088,'红叶88号','男','1991-12-12','mercy88@163.com','notes88'),
('c685be2af1834e0ea15a632184974b86',20210021,'红叶21号','女','1991-12-12','mercy21@163.com','notes21'),
('ca5c242c9ba34e7299f353ce38bc9029',20210078,'红叶78号','男','1991-12-12','mercy78@163.com','notes78'),
('cb59aa0940cd4a209f62f2454e8f819f',20210103,'红叶103号','女','1991-12-12','mercy103@163.com','notes103'),
('ce4e313106634161b3bcbd318f206455',20210093,'红叶93号','女','1991-12-12','mercy93@163.com','notes93'),
('d2708408b4544267adac54a62adba38e',20210065,'红叶65号','女','1991-12-12','mercy65@163.com','notes65'),
('d2a9fd0f520c45c1b92383db7f4ed5ef',20210098,'红叶98号','男','1991-12-12','mercy98@163.com','notes98'),
('d3a0e2efdc3b4b7fa96ffd4d8ad58d5c',20210031,'红叶31号','女','1991-12-12','mercy31@163.com','notes31'),
('d8070ed9bc974e0394d99775e2a8e5c6',20210094,'红叶94号','男','1991-12-12','mercy94@163.com','notes94'),
('d8c06f46789a4ebc9d0511a2e56b204b',20210072,'红叶72号','男','1991-12-12','mercy72@163.com','notes72'),
('d93d38e9f0244ecc98bef6a68b1f393c',20210056,'红叶56号','男','1991-12-12','mercy56@163.com','notes56'),
('dd3bf865feb349aba9c9b3db05ca92c2',20210014,'红叶14号','男','1991-12-12','mercy14@163.com','notes14'),
('e04d1fefcdee48278a650215e0c599bd',20210106,'红叶106号','男','1991-12-12','mercy106@163.com','notes106'),
('e3a14a6a55724fcca4c9c2ab25da3bf5',20210074,'红叶74号','男','1991-12-12','mercy74@163.com','notes74'),
('e66f7e9f3c34465c970fb3a8f61a71aa',20210036,'红叶36号','男','1991-12-12','mercy36@163.com','notes36'),
('e71015d8301a48889c12d7b7f51becd1',20210064,'红叶64号','男','1991-12-12','mercy64@163.com','notes64'),
('ebba982edcc149649a1d3b872433168d',20210022,'红叶22号','男','1991-12-12','mercy22@163.com','notes22'),
('ebe4d9e7f209487ea3f9170953dbb01a',20210084,'红叶84号','男','1991-12-12','mercy84@163.com','notes84'),
('ec3f1f231f9445bba6b9449495881a47',20210076,'红叶76号','男','1991-12-12','mercy76@163.com','notes76'),
('ec711afa59c34f689e365d74984ebce1',20210015,'红叶15号','女','1991-12-12','mercy15@163.com','notes15'),
('edcb0c2a389647c58e65356227dc7345',20210025,'红叶25号','女','1991-12-12','mercy25@163.com','notes25'),
('f2c5becbd2bd46bd894a970c404b7e25',20210041,'红叶41号','女','1991-12-12','mercy41@163.com','notes41'),
('f45b66b5d36c4d75acaf6657fbe17c7a',20210018,'红叶18号','男','1991-12-12','mercy18@163.com','notes18'),
('fa0692c0563b40b3af96dffcea7ed125',20210048,'红叶48号','男','1991-12-12','mercy48@163.com','notes48'),
('fa550e96604346a1b03b5d5107671bb5',20210027,'红叶27号','女','1991-12-12','mercy27@163.com','notes27');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
